export const programs = {
    html: [
      {
        name: "Основы HTML и структуры документа",
        lessons: [
          "Введение в HTML",
          "Теги и их структура",
          "Базовый документ HTML"
        ]
      },
      {
        name: "Работа с текстом",
        lessons: [
          "Заголовки и абзацы",
          "Списки",
          "Теги для текста",
          "Цитаты и блоки кода",
          "Разделение контента"
        ]
      },
      {
        name: "Работа с изображениями и мультимедиа",
        lessons: [
          "Вставка изображений",
          "Работа с аудио",
          "Вставка видео",
          "Ссылки на мультимедиа"
        ]
      },
      {
        name: "Ссылки и навигация",
        lessons: [
          "Создание ссылок",
          "Создание навигации",
          "Ссылки на внешние ресурсы"
        ]
      },
      {
        name: "Таблицы",
        lessons: [
          "Основы таблиц",
          "Стилизация таблиц",
          "Таблицы с вложенными элементами"
        ]
      },
      {
        name: "Работа с формами",
        lessons: [
          "Основы форм",
          "Поле ввода текста",
          "Чекбоксы и радиокнопки",
          "Селекты и списки",
          "Текстовые области",
          "Кнопки и отправка формы",
          "Валидация формы",
          "Работа с файлами"
        ]
      },
      {
        name: "Семантические теги HTML5",
        lessons: [
          "Что такое семантические теги?",
          "Теги для разметки страниц",
          "Тег <figure> и <figcaption>",
          "Тег <details> и <summary>"
        ]
      },
      {
        name: "Работа с мета-тегами и документами",
        lessons: [
          "Мета-теги",
          "Подключение внешних файлов",
          "Работа с фавиконками"
        ]
      },
      {
        name: "Местоположение и работа с данными",
        lessons: [
          "Геолокация HTML5",
          "Работа с веб-форматами данных",
          "Хранение данных в браузере"
        ]
      },
      {
        name: "Современные возможности HTML5",
        lessons: [
          "Сохранение данных с помощью IndexedDB",
          "Web Workers",
          "Drag and Drop API"
        ]
      },
      {
        name: "Продвинутые концепции и интеграция с другими технологиями",
        lessons: [
          "Интеграция HTML с CSS и JavaScript",
          "Микроразметка (Schema.org)",
          "Встраивание сторонних элементов",
          "Взаимодействие с внешними API"
        ]
      },
      {
        name: "Финальные шаги",
        lessons: [
          "Оптимизация HTML-кода",
          "Тестирование и отладка HTML-документов",
          "Лучшие практики разработки на HTML"
        ]
      }
    ]
  };